// Обработка создана на базе проекта `Шаблон дополнительной обработки для конфигураций 1с на основе БСП`
// Документация и новые версии шаблона доступны по ссылке 
// https://github.com/ilko-os/1c-additional-data-processor-template


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	МетаданныеОбработки = ОбработкаОбъект.Метаданные();

	ИмяОбработки = МетаданныеОбработки.Имя;
	ПутьМетаданных = "ВнешняяОбработка." + ИмяОбработки;

	ДополнительнаяОбработка = ПолучитьСсылкуДополнительнойОбработкиПоИмени(ИмяОбработки);

	Если ЗначениеЗаполнено(ДополнительнаяОбработка) Тогда
		ТаблицаКоманд = ОбработкаОбъект.СведенияОВнешнейОбработке().Команды;
		Для Каждого стр Из ТаблицаКоманд Цикл
			Если стр.Использование = "ВызовСерверногоМетода" Тогда
				Элементы.ИдентификаторКоманды.СписокВыбора.Добавить(стр.Идентификатор, стр.Представление);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ПоказатьЗначенияБезопасногоХранилища = Ложь;
	РежимЗагрузкиНастроекПоУмолчанию = "Обновление";

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ИзменитьОтображениеЗначенияБезопасногоХранилища();

	Если Не ЗначениеЗаполнено(ДополнительнаяОбработка) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Зарегистрируйте обработку в дополнительных отчетах и обработках и повторите открытие";
		Сообщение.Поле = "ДополнительнаяОбработка"; //имя реквизита 
		//Сообщение.УстановитьДанные(); //Ссылка на объект ИБ
		Сообщение.Сообщить();

		Возврат;

	КонецЕсли;

	ПодключитьОбработчикОжидания("ПрочитатьНастройкиОбработкиНаКлиенте", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНастройкиОбработкиНаКлиенте()
	ПрочитатьНастройкиОбработкиНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторКомандыПриИзменении(Элемент)

	ПрочитатьНастройкиКомандыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗначенияБезопасногоХранилищаПриИзменении(Элемент)
	ИзменитьОтображениеЗначенияБезопасногоХранилища();
КонецПроцедуры
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиОбработки

//НастройкиОбработки_Таблица

&НаКлиенте
Процедура НастройкиОбработкиПриАктивизацииСтроки(Элемент)
	ИмяТаблицы = "НастройкиОбработки";
	ТаблицаПриАктивизацииСтроки(Элемент, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбработкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ИмяТаблицы = "НастройкиОбработки";
	ТаблицаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ, ИмяТаблицы);
КонецПроцедуры


// НастройкиОбработки_ТипЗначения

&НаКлиенте
Процедура НастройкиОбработкиТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиОбработки";
	ТаблицаТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры


// НастройкиОбработки_Значение

&НаКлиенте
Процедура НастройкиОбработкиЗначениеПриИзменении(Элемент)
	ИмяТаблицы = "НастройкиОбработки";
	ТаблицаЗначениеПриИзменении(ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбработкиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиОбработки";
	ТаблицаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбработкиЗначениеОчистка(Элемент, СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиОбработки";
	ТаблицаЗначениеОчистка(Элемент, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбработкиЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением,
	СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиОбработки";
	ТаблицаЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбработкиЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
	СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиОбработки";
	ТаблицаЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка,
		ИмяТаблицы);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиОбработкиБезопасноеХранилище

// НастройкиОбработкиБезопасноеХранилище_Таблица

&НаКлиенте
Процедура НастройкиОбработкиБезопасноеХранилищеПриАктивизацииСтроки(Элемент)
	ИмяТаблицы = "НастройкиОбработкиБезопасноеХранилище";
	ТаблицаПриАктивизацииСтроки(Элемент, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбработкиБезопасноеХранилищеПередОкончаниемРедактирования(Элемент, НоваяСтрока,
	ОтменаРедактирования, Отказ)
	ИмяТаблицы = "НастройкиОбработкиБезопасноеХранилище";
	ТаблицаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ, ИмяТаблицы);
КонецПроцедуры


// НастройкиОбработкиБезопасноеХранилище_ТипЗначения

&НаКлиенте
Процедура НастройкиОбработкиБезопасноеХранилищеТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
	СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиОбработкиБезопасноеХранилище";
	ТаблицаТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры


// НастройкиОбработкиБезопасноеХранилище_Значение

&НаКлиенте
Процедура НастройкиОбработкиБезопасноеХранилищеЗначениеПриИзменении(Элемент)
	ИмяТаблицы = "НастройкиОбработкиБезопасноеХранилище";
	ТаблицаЗначениеПриИзменении(ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбработкиБезопасноеХранилищеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
	СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиОбработкиБезопасноеХранилище";
	ТаблицаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбработкиБезопасноеХранилищеЗначениеОчистка(Элемент, СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиОбработкиБезопасноеХранилище";
	ТаблицаЗначениеОчистка(Элемент, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбработкиБезопасноеХранилищеЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение,
	ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиОбработкиБезопасноеХранилище";
	ТаблицаЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбработкиБезопасноеХранилищеЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора,
	ПараметрыПолученияДанных, СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиОбработкиБезопасноеХранилище";
	ТаблицаЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка,
		ИмяТаблицы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиКоманды

// НастройкиКоманды_Таблица

&НаКлиенте
Процедура НастройкиКомандыПриАктивизацииСтроки(Элемент)
	ИмяТаблицы = "НастройкиКоманды";
	ТаблицаПриАктивизацииСтроки(Элемент, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКомандыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ИмяТаблицы = "НастройкиКоманды";
	ТаблицаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ, ИмяТаблицы);
КонецПроцедуры


// НастройкиКоманды_ТипЗначения

&НаКлиенте
Процедура НастройкиКомандыТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ИмяТаблицы = "НастройкиКоманды";
	ТаблицаТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка, ИмяТаблицы);

КонецПроцедуры


// НастройкиКоманды_Значение

&НаКлиенте
Процедура НастройкиКомандыЗначениеПриИзменении(Элемент)
	ИмяТаблицы = "НастройкиКоманды";
	ТаблицаЗначениеПриИзменении(ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКомандыЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиКоманды";
	ТаблицаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКомандыЗначениеОчистка(Элемент, СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиКоманды";
	ТаблицаЗначениеОчистка(Элемент, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКомандыЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением,
	СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиКоманды";
	ТаблицаЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКомандыЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
	СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиКоманды";
	ТаблицаЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка,
		ИмяТаблицы);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиКомандыБезопасноеХранилище

// НастройкиКомандыБезопасноеХранилище_Таблица

&НаКлиенте
Процедура НастройкиКомандыБезопасноеХранилищеПриАктивизацииСтроки(Элемент)
	ИмяТаблицы = "НастройкиКомандыБезопасноеХранилище";
	ТаблицаПриАктивизацииСтроки(Элемент, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКомандыБезопасноеХранилищеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования,
	Отказ)
	ИмяТаблицы = "НастройкиКомандыБезопасноеХранилище";
	ТаблицаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ, ИмяТаблицы);
КонецПроцедуры


// НастройкиКомандыБезопасноеХранилище_ТипЗначения

&НаКлиенте
Процедура НастройкиКомандыБезопасноеХранилищеТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
	СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиКомандыБезопасноеХранилище";
	ТаблицаТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры


// НастройкиКомандыБезопасноеХранилище_Значение

&НаКлиенте
Процедура НастройкиКомандыБезопасноеХранилищеЗначениеПриИзменении(Элемент)
	ИмяТаблицы = "НастройкиКомандыБезопасноеХранилище";
	ТаблицаЗначениеПриИзменении(ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКомандыБезопасноеХранилищеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением,
	СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиКомандыБезопасноеХранилище";
	ТаблицаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКомандыБезопасноеХранилищеЗначениеОчистка(Элемент, СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиКомандыБезопасноеХранилище";
	ТаблицаЗначениеОчистка(Элемент, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКомандыБезопасноеХранилищеЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные,
	ВыборДобавлением, СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиКомандыБезопасноеХранилище";
	ТаблицаЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКомандыБезопасноеХранилищеЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора,
	ПараметрыПолученияДанных, СтандартнаяОбработка)
	ИмяТаблицы = "НастройкиКомандыБезопасноеХранилище";
	ТаблицаЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка,
		ИмяТаблицы);
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)

	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Настройки обработки модифицированы, сохраните перед выполнением команды");
		Возврат;
	КонецЕсли;

	ВыполнитьКомандуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиКомандыПоУмолчанию(Команда)
	ЗагрузитьНастройкиКомандыПоУмолчаниюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиОбработкиПоУмолчанию(Команда)
	ЗагрузитьНастройкиОбработкиПоУмолчаниюНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура СохранитьНастройкиОбработки(Команда)

	СохранитьНастройкиОбработкиНаСервере();

	Модифицированность = Ложь;

	ОповеститьОбИзменении(ДополнительнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиКоманды(Команда)

	СохранитьНастройкиКомандыНаСервере();

	Модифицированность = Ложь;

	ОповеститьОбИзменении(ДополнительнаяОбработка);

КонецПроцедуры

// Чтение настройек из хранилищ
&НаКлиенте
Процедура ПрочитатьНастройкиОбработки(Команда)
	ПрочитатьНастройкиОбработкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНастройкиКоманды(Команда)
	ПрочитатьНастройкиКомандыНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура ЭкспортироватьНастройки(Команда)

	АдресФайла = "";
	ЭкспортироватьНастройкиНаСервере(АдресФайла);
	
	//@skip-check use-non-recommended-method
	ТекДата = ТекущаяДата();
	ИмяФайла = СтрШаблон("%1_Настройки_%2.txt", ИмяОбработки, Формат(ТекДата, "ДФ=yyyy-MM-dd_HHmmss;"));
	//@skip-check bsl-legacy-check-static-feature-access
	ПолучитьФайл(АдресФайла, ИмяФайла);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ИмпортироватьНастройки(Команда)
	ОписаниеПомещенногоФайла = Ждать ПоместитьФайлНаСерверАсинх();
	ИмпортироватьНастройкиНаСервере(ОписаниеПомещенногоФайла.Адрес);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНастройки(Команда)
	ОчиститьНастройкиНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеОбработчикиСобытийЭлементовТаблицыФормы

// Таблица
&НаКлиенте
Процедура ТаблицаПриАктивизацииСтроки(Элемент, ИмяТаблицы)
	УстановитьПараметрыВводаЗначения(ИмяТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ, ИмяТаблицы)

	ОбработатьИзменениеИмениПараметра(НоваяСтрока, ОтменаРедактирования, Отказ, ИмяТаблицы);

КонецПроцедуры


// Таблица_ТипЗначения

&НаКлиенте
Процедура ТаблицаТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка, ИмяТаблицы)

	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	ТекущаяСтрока =  Элементы[ИмяТаблицы].ТекущаяСтрока;

	Если ТекущиеДанные.ТипКонтейнера < 3 Тогда
		ТипЗначения = ТекущиеДанные.ТипЗначения;
	Иначе
		ТипЗначения = ТекущиеДанные.Контейнер;
	КонецЕсли;

	ПараметрыОповещения = Новый Структура("ИмяТаблицы, Строка, Поле", ИмяТаблицы, ТекущаяСтрока, "ТипЗначения");

	ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтроки", ЭтотОбъект,
		ПараметрыОповещения);

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Объект", Объект);
	ПараметрыОткрытия.Вставить("ТипЗначения", ТипЗначения);
	ПараметрыОткрытия.Вставить("ТипКонтейнера", ТекущиеДанные.ТипКонтейнера);
	ПараметрыОткрытия.Вставить("Имя", ТекущиеДанные.Имя);
	ПараметрыОткрытия.Вставить("ВЗапросРазрешено", Истина);

	ОткрытьФорму(ПолноеИмяФормы("РедактированиеТипа"), ПараметрыОткрытия, ЭтотОбъект, Истина, , ,
		ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

// Таблица_Значение

&НаКлиенте
Процедура ТаблицаЗначениеПриИзменении(ИмяТаблицы)

	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;

	Если ТекущиеДанные.ТипКонтейнера = 0 Тогда

		ТекущиеДанные.Контейнер = ТекущиеДанные.Значение;
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ТипЗначения) Тогда
			ТекущиеДанные.ТипЗначения = ОписаниеТиповПоТипу(ТипЗнч(ТекущиеДанные.Значение));
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ИмяТаблицы)

	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;

	Если ТекущиеДанные.ТипКонтейнера > 0 Тогда

		СтандартнаяОбработка = Ложь;
		ПараметрыОповещения = Новый Структура("ИмяТаблицы, Строка, Поле", ИмяТаблицы, Элемент.Родитель.ТекущаяСтрока,
			"Контейнер");
		ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтроки",
			ЭтотОбъект, ПараметрыОповещения);

		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Объект", Объект);
		ПараметрыОткрытия.Вставить("ТипЗначения", ТекущиеДанные.ТипЗначения);
		ПараметрыОткрытия.Вставить("Заголовок", ТекущиеДанные.Имя);
		ПараметрыОткрытия.Вставить("Значение", ТекущиеДанные.Контейнер);
		ПараметрыОткрытия.Вставить("ТипКонтейнера", ТекущиеДанные.ТипКонтейнера);

		Если ТекущиеДанные.ТипКонтейнера = 3 Тогда
			ИмяФормыРедактирования = "РедактированиеТаблицы";
		Иначе
			ИмяФормыРедактирования = "ПодборВСписок";
		КонецЕсли;

		ОткрытьФорму(ПолноеИмяФормы(ИмяФормыРедактирования), ПараметрыОткрытия, ЭтотОбъект, Ложь, , ,
			ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ИначеЕсли ТипЗнч(ТекущиеДанные.Контейнер) = Тип("Структура") Тогда

		Если ТекущиеДанные.Контейнер.Тип = "МоментВремени" Или ТекущиеДанные.Контейнер.Тип = "Граница" Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыЗапроса",
				Элемент.Родитель.ТекущаяСтрока, "Контейнер");
			ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтроки",
				ЭтотОбъект, ПараметрыОповещения);
			ПараметрыОткрытия = Новый Структура("Объект, Значение", Объект, ТекущиеДанные.Контейнер);
			ОткрытьФорму(ПолноеИмяФормы("РедактированиеГраницыМомента"), ПараметрыОткрытия, ЭтотОбъект, Ложь, , ,
				ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли ТекущиеДанные.Контейнер.Тип = "Тип" Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыЗапроса",
				Элемент.Родитель.ТекущаяСтрока, "КонтейнерКакТип");
			ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтроки",
				ЭтотОбъект, ПараметрыОповещения);
			ПараметрыОткрытия = Новый Структура("Объект, ТипЗначения, ТипКонтейнера", Объект, ТекущиеДанные.Контейнер,
				ТекущиеДанные.ТипКонтейнера);
			ОткрытьФорму(ПолноеИмяФормы("РедактированиеТипа"), ПараметрыОткрытия, ЭтотОбъект, Истина, , ,
				ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;

	Иначе
		Если ТипЗнч(ТекущиеДанные.Значение) = Тип("УникальныйИдентификатор") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыЗапроса",
				Элемент.Родитель.ТекущаяСтрока, "Значение");
			ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтроки",
				ЭтотОбъект, ПараметрыОповещения);
			ПараметрыОткрытия = Новый Структура("Объект, Значение", Объект, ТекущиеДанные.Значение);
			ОткрытьФорму(ПолноеИмяФормы("РедактированиеУникальногоИдентификатора"), ПараметрыОткрытия, ЭтотОбъект,
				Истина, , , ОписаниеОповещенияОЗакрытииОткрываемойФормы,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначениеОчистка(Элемент, СтандартнаяОбработка, ИмяТаблицы)

	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;

	Если ТекущиеДанные.ТипКонтейнера = 0 Тогда
		КоличествоТипов = ТекущиеДанные.ТипЗначения.Типы().Количество();
		Если КоличествоТипов = 0 Или КоличествоТипов > 1 Тогда
			ТекущиеДанные.Значение = Неопределено;
		Иначе
			ТекущиеДанные.Значение = ТекущиеДанные.ТипЗначения.ПривестиЗначение(Неопределено);
		КонецЕсли;
	ИначеЕсли ТекущиеДанные.ТипКонтейнера = 3 Тогда
	КонецЕсли;

	УстановитьПараметрыВводаЗначения(ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ИмяТаблицы)

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда
		ОграничениеТипа = Элементы[ИмяТаблицы + "Значение"].ОграничениеТипа;
		МассивТипы = Новый Массив;
		МассивТипы.Добавить(ВыбранноеЗначение);
		ТипЗначения = Новый ОписаниеТипов(МассивТипы, ОграничениеТипа.КвалификаторыЧисла,
			ОграничениеТипа.КвалификаторыСтроки, ОграничениеТипа.КвалификаторыДаты);
		Значение = ТипЗначения.ПривестиЗначение(Элементы[ИмяТаблицы].ТекущиеДанные.Значение);
		Элементы[ИмяТаблицы].ТекущиеДанные.Значение = Значение;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

	УстановитьПараметрыВводаЗначения(ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных,
	СтандартнаяОбработка, ИмяТаблицы)

	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные.Контейнер) = Тип("Структура") И ТекущиеДанные.Контейнер.Тип = "УникальныйИдентификатор" Тогда
		Попытка
			Значение = Новый УникальныйИдентификатор(Текст);
		Исключение
			ВызватьИсключение "Не корректное значение уникального идентификатора";
		КонецПопытки;
		Таблица_СохранитьЗначение(Элементы[ИмяТаблицы].ТекущаяСтрока, Значение, ИмяТаблицы);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
&НаСервере
Процедура ВыполнитьКомандуНаСервере()

	Если ЗначениеЗаполнено(ИдентификаторКоманды) Тогда

		ПараметрыВыполнения = Новый Структура("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработка);

		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ОбработкаОбъект.ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполнения);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтображениеЗначенияБезопасногоХранилища()

	Элементы.НастройкиОбработкиБезопасноеХранилищеЗначение.РежимПароля = Не ПоказатьЗначенияБезопасногоХранилища;
	Элементы.НастройкиКомандыБезопасноеХранилищеЗначение.РежимПароля = Не ПоказатьЗначенияБезопасногоХранилища;

КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРедактированияСтроки(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ИмяТаблицы = ДополнительныеПараметры.ИмяТаблицы;
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеПараметры.Поле = "Контейнер" Тогда
		Таблица_СохранитьЗначение(ДополнительныеПараметры.Строка, РезультатЗакрытия.Значение, ИмяТаблицы);

	ИначеЕсли ДополнительныеПараметры.Поле = "КонтейнерКакТип" Тогда
		//ПараметрыЗапроса_СохранитьЗначение(ДополнительныеПараметры.Строка, РезультатЗакрытия.ОписаниеКонтейнера);
	ИначеЕсли ДополнительныеПараметры.Поле = "ТипЗначения" Тогда

		ОписаниеКонтейнера = РезультатЗакрытия.ОписаниеКонтейнера;

		ИдСтрокаПараметра = ДополнительныеПараметры.Строка;
		Если идСтрокаПараметра = Неопределено Тогда
				//добавление нового параметра
			СтрокаПараметра = ДобавитьПараметрСКонтролемИмени(РезультатЗакрытия.ИмяПараметра);
			СтрокаПараметра.ТипКонтейнера = РезультатЗакрытия.ТипКонтейнера;
			ИдСтрокаПараметра = СтрокаПараметра.ПолучитьИдентификатор();
		КонецЕсли;

		ПараметрыТаблицы_УстановитьТип(ИдСтрокаПараметра, РезультатЗакрытия.ТипКонтейнера, ОписаниеКонтейнера,
			ИмяТаблицы);

		УстановитьПараметрыВводаЗначения(ИмяТаблицы);

	ИначеЕсли ДополнительныеПараметры.Поле = "Значение" Тогда
		Элементы.ПараметрыЗапроса.ТекущиеДанные.Значение = РезультатЗакрытия.Значение;
		Элементы.ПараметрыЗапроса.ТекущиеДанные.Контейнер = РезультатЗакрытия.Значение;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиОбработкиНаСервере()

	Если Не ЗначениеЗаполнено(ДополнительнаяОбработка) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено обязательные поле ""Дополнительная обработка""";
		Сообщение.Поле = "ДополнительнаяОбработка";
		Сообщение.Сообщить();

		Возврат;

	КонецЕсли;

	НастройкиОбработки.Очистить();
	НастройкиОбработкиБезопасноеХранилище.Очистить();

	
	//  Чтение из хранилища обработки

	ДополнительнаяОбработкаОбъект = ДополнительнаяОбработка.ПолучитьОбъект();
	НастройкиИзХранилищаНастроекОбработки = ДополнительнаяОбработкаОбъект.ХранилищеНастроек.Получить();

	Если ТипЗнч(НастройкиИзХранилищаНастроекОбработки) = Тип("Структура") Тогда

		Если НастройкиИзХранилищаНастроекОбработки.Свойство("НастройкиОбработки") Тогда
			НастройкиОбработки.Загрузить(НастройкиИзХранилищаНастроекОбработки.НастройкиОбработки);
		КонецЕсли;

	КонецЕсли;
	
	// Чтение из безопасного хранилища

	НастройкиИзБезопасногоХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ДополнительнаяОбработка);

	Если ТипЗнч(НастройкиИзБезопасногоХранилища) = Тип("Структура") Тогда

		Если НастройкиИзБезопасногоХранилища.Свойство("НастройкиОбработкиБезопасноеХранилище") Тогда
			НастройкиОбработкиБезопасноеХранилище.Загрузить(
				НастройкиИзБезопасногоХранилища.НастройкиОбработкиБезопасноеХранилище);
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиКомандыНаСервере()

	Если Не ЗначениеЗаполнено(ДополнительнаяОбработка) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено обязательные поле ""Дополнительная обработка""";
		Сообщение.Поле = "ДополнительнаяОбработка";
		Сообщение.Сообщить();

		Возврат;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторКоманды) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено обязательные поле ""Идентификатор команды""";
		Сообщение.Поле = "ИдентификаторКоманды";
		Сообщение.Сообщить();

		Возврат;

	КонецЕсли;

	НастройкиКоманды.Очистить();
	НастройкиКомандыБезопасноеХранилище.Очистить(); 
	
	//  Чтение из хранилища обработки

	ДополнительнаяОбработкаОбъект = ДополнительнаяОбработка.ПолучитьОбъект();
	НастройкиИзХранилищаНастроекОбработки = ДополнительнаяОбработкаОбъект.ХранилищеНастроек.Получить();

	Если ТипЗнч(НастройкиИзХранилищаНастроекОбработки) = Тип("Структура") Тогда

		Если ЗначениеЗаполнено(ИдентификаторКоманды) И НастройкиИзХранилищаНастроекОбработки.Свойство(
			ИдентификаторКоманды) Тогда
			НастройкиКоманды.Загрузить(НастройкиИзХранилищаНастроекОбработки[ИдентификаторКоманды]);
		КонецЕсли;

	КонецЕсли;
	
	// Чтение из безопасного хранилища

	НастройкиИзБезопасногоХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ДополнительнаяОбработка);

	Если ТипЗнч(НастройкиИзБезопасногоХранилища) = Тип("Структура") Тогда

		Если ЗначениеЗаполнено(ИдентификаторКоманды) И НастройкиИзБезопасногоХранилища.Свойство(ИдентификаторКоманды) Тогда
			НастройкиКомандыБезопасноеХранилище.Загрузить(НастройкиИзБезопасногоХранилища[ИдентификаторКоманды]);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОбработкиНаСервере()

	Если Не ЗначениеЗаполнено(ДополнительнаяОбработка) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено обязательные поле ""Дополнительная обработка""";
		Сообщение.Поле = "ДополнительнаяОбработка";
		Сообщение.Сообщить();

		Возврат;

	КонецЕсли;  
	
	// Сохранение в хранилище обработки

	ДополнительнаяОбработкаОбъект = ДополнительнаяОбработка.ПолучитьОбъект();
	НастройкиДляСохранения = ДополнительнаяОбработкаОбъект.ХранилищеНастроек.Получить();

	Если НастройкиДляСохранения = Неопределено Тогда
		НастройкиДляСохранения = Новый Структура;
	КонецЕсли;

	НастройкиДляСохранения.Вставить("НастройкиОбработки", НастройкиОбработки.Выгрузить());

	ДополнительнаяОбработкаОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(НастройкиДляСохранения);
	ДополнительнаяОбработкаОбъект.Записать(); 
	
	
	// Сохранение в безопасное хранилище 

	НастройкиДляСохраненияБезопасноеХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ДополнительнаяОбработка);

	Если НастройкиДляСохраненияБезопасноеХранилище = Неопределено Тогда
		НастройкиДляСохраненияБезопасноеХранилище = Новый Структура;
	КонецЕсли;

	НастройкиДляСохраненияБезопасноеХранилище.Вставить("НастройкиОбработкиБезопасноеХранилище",
		НастройкиОбработкиБезопасноеХранилище.Выгрузить());

	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ДополнительнаяОбработка,
		НастройкиДляСохраненияБезопасноеХранилище);

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиКомандыНаСервере()

	Если Не ЗначениеЗаполнено(ДополнительнаяОбработка) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено обязательные поле ""Дополнительная обработка""";
		Сообщение.Поле = "ДополнительнаяОбработка";
		Сообщение.Сообщить();

		Возврат;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторКоманды) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено обязательные поле ""Идентификатор команды""";
		Сообщение.Поле = "ИдентификаторКоманды";
		Сообщение.Сообщить();

		Возврат;

	КонецЕсли;
	
	// Сохранение в хранилище обработки

	ДополнительнаяОбработкаОбъект = ДополнительнаяОбработка.ПолучитьОбъект();
	НастройкиДляСохранения = ДополнительнаяОбработкаОбъект.ХранилищеНастроек.Получить();

	Если НастройкиДляСохранения = Неопределено Тогда
		НастройкиДляСохранения = Новый Структура;
	КонецЕсли;

	НастройкиДляСохранения.Вставить(ИдентификаторКоманды, НастройкиКоманды.Выгрузить());

	ДополнительнаяОбработкаОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(НастройкиДляСохранения);
	ДополнительнаяОбработкаОбъект.Записать(); 
	
	
	// Сохранение в безопасное хранилище 

	НастройкиДляСохраненияБезопасноеХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ДополнительнаяОбработка);

	Если НастройкиДляСохраненияБезопасноеХранилище = Неопределено Тогда
		НастройкиДляСохраненияБезопасноеХранилище = Новый Структура;
	КонецЕсли;

	НастройкиДляСохраненияБезопасноеХранилище.Вставить(ИдентификаторКоманды,
		НастройкиКомандыБезопасноеХранилище.Выгрузить());

	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ДополнительнаяОбработка,
		НастройкиДляСохраненияБезопасноеХранилище);

КонецПроцедуры
&НаКлиенте
Функция ПолноеИмяФормы(ИмяФормы)
	Возврат СтрШаблон("%1.Форма.%2", ПутьМетаданных, ИмяФормы);
КонецФункции

&НаСервере
Процедура Таблица_СохранитьЗначение(СтрокаИд, Знач Значение, ИмяТаблицы)

	СтрокаПараметр = ЭтотОбъект[ИмяТаблицы].НайтиПоИдентификатору(СтрокаИд);

	Если СтрокаПараметр.ТипКонтейнера = 0 Тогда
		СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Значение);
		Если ТипЗнч(СтрокаПараметр.Контейнер) = Тип("Структура") Тогда
			СтрокаПараметр.Значение = СтрокаПараметр.Контейнер.Представление;
		Иначе
			СтрокаПараметр.Значение = Значение;
		КонецЕсли;
	ИначеЕсли СтрокаПараметр.ТипКонтейнера = 1 Тогда
		СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Значение);
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер.Представление;
	ИначеЕсли СтрокаПараметр.ТипКонтейнера = 2 Тогда
		СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Значение);
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер.Представление;
	ИначеЕсли СтрокаПараметр.ТипКонтейнера = 3 Тогда
		СтрокаПараметр.ТипЗначения = "Таблица значений";
		СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Значение);
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер.Представление;
	Иначе
		ВызватьИсключение "Ошибка в типе контейнера параметра";
	КонецЕсли;

	Модифицированность = Истина;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеТиповПоТипу(Тип)
	МассивТипы = Новый Массив;
	МассивТипы.Добавить(Тип);
	Возврат Новый ОписаниеТипов(МассивТипы);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяКорректно(ПроверяемоеИмя)

	Если Не ЗначениеЗаполнено(ПроверяемоеИмя) Тогда
		Возврат Ложь;
	КонецЕсли;

	Попытка
		//@skip-warning
		ст = Новый Структура(ПроверяемоеИмя);
	Исключение
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;

КонецФункции
&НаКлиенте
Процедура УстановитьПараметрыВводаЗначения(ИмяТаблицы)

	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;

	ЭлементЗначение = Элементы[ИмяТаблицы + "Значение"];

	Если ТекущиеДанные <> Неопределено Тогда

		ЭлементЗначение.КартинкаКнопкиВыбора = Новый Картинка;

		Если ЗначениеЗаполнено(ТекущиеДанные.ТипКонтейнера) Тогда

			ЭлементЗначение.КнопкаОчистки = Ложь;
			ЭлементЗначение.КнопкаВыбора = Истина;
			ЭлементЗначение.ВыбиратьТип = Ложь;
			ЭлементЗначение.РедактированиеТекста = Ложь;
			ЭлементЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			ЭлементЗначение.КартинкаКнопкиВыбора = БиблиотекаКартинок.Изменить;

		ИначеЕсли ТипЗнч(ТекущиеДанные.Контейнер) = Тип("Структура") Тогда

			ЭлементЗначение.КнопкаОчистки = Ложь;
			ЭлементЗначение.КнопкаВыбора = Истина;
			ЭлементЗначение.ВыбиратьТип = Ложь;
			ЭлементЗначение.КартинкаКнопкиВыбора = БиблиотекаКартинок.Изменить;
			ЭлементЗначение.РедактированиеТекста = Ложь;
			ЭлементЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");

		Иначе

			ЭлементЗначение.РедактированиеТекста = Истина;
			Если ЗначениеЗаполнено(ТекущиеДанные.ТипЗначения) Тогда
				ЭлементЗначение.ОграничениеТипа = ТекущиеДанные.ТипЗначения;
			Иначе
				ЭлементЗначение.ОграничениеТипа = Новый ОписаниеТипов;
			КонецЕсли;

			Если ТекущиеДанные.Значение = Неопределено И ЭлементЗначение.ОграничениеТипа.Типы().Количество() > 1 Тогда

				ЭлементЗначение.ВыбиратьТип = Истина;
				ЭлементЗначение.КнопкаВыбора = Истина;
				ЭлементЗначение.КнопкаОчистки = Ложь;

			Иначе

				ЭлементЗначение.ВыбиратьТип = Ложь;
				ЭлементЗначение.КнопкаОчистки = Истина;
				ЭлементЗначение.КнопкаВыбора = НужнаКнопкаВыбораЗначению(ТекущиеДанные.Значение);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ДобавитьПараметрСКонтролемИмени(ИмяПараметра)

	СтрИспользуемоеИмяПараметра = ИмяПараметра;
	Счетчик = 1;
	Пока Истина Цикл

		МассивСтрок = НастройкиКоманды.НайтиСтроки(Новый Структура("Имя", СтрИспользуемоеИмяПараметра));
		Если МассивСтрок.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;

		СтрИспользуемоеИмяПараметра = ИмяПараметра + Счетчик;
		Счетчик = Счетчик + 1;

	КонецЦикла;

	НоваяСтрока = НастройкиКоманды.Добавить();
	НоваяСтрока.Имя = СтрИспользуемоеИмяПараметра;

	Возврат НоваяСтрока;

КонецФункции

&НаСервере
Процедура ПараметрыТаблицы_УстановитьТип(СтрокаИд, ТипКонтейнера, ТипЗначения, ИмяТаблицы)

	СтрокаПараметр = ЭтотОбъект[ИмяТаблицы].НайтиПоИдентификатору(СтрокаИд);   //   ЭтотОбъект["НастройкиКоманды"].НайтиПоИдентификатору(СтрокаИд)
	Контейнер = СтрокаПараметр.Контейнер;

	Если ТипКонтейнера = 1 Или ТипКонтейнера = 2 Тогда

		Если СтрокаПараметр.ТипКонтейнера = 1 Или СтрокаПараметр.ТипКонтейнера = 2 Тогда
			КонтейнерМассив = Контейнер12ВМассив(Контейнер);
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 3 Тогда
			//Была ТЗ, теперь СЗ. Надо достать первую ячейку.
			Таблица = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер);
			КонтейнерМассив = Таблица.ВыгрузитьКолонку(0);
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 0 Тогда

			КонтейнерМассив = Новый Массив;

			КонтейнерМассив.Добавить(РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер));
			//Если ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
			//	КонтейнерМассив.Добавить(СтрокаПараметр.Значение);
			//КонецЕсли;

			СтрокаПараметр.Значение = Неопределено;

		КонецЕсли;

		Если ТипКонтейнера = 1 Тогда
			НовыйСписок = Новый СписокЗначений;
			НовыйСписок.ЗагрузитьЗначения(КонтейнерМассив);
			НовыйСписок.ТипЗначения = ТипЗначения;
			СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(НовыйСписок);
		ИначеЕсли ТипКонтейнера = 2 Тогда
			НовыйСписок = Новый СписокЗначений;
			НовыйСписок.ЗагрузитьЗначения(КонтейнерМассив);
			НовыйСписок.ТипЗначения = ТипЗначения;
			КонтейнерМассив = НовыйСписок.ВыгрузитьЗначения();
			СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(КонтейнерМассив);
		КонецЕсли;

	ИначеЕсли ТипКонтейнера = 3 Тогда

		Если СтрокаПараметр.ТипКонтейнера = 1 Или СтрокаПараметр.ТипКонтейнера = 2 Тогда
			Таблица = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(ТипЗначения);
			Значение = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер);
			Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
				Значение = Значение.ВыгрузитьЗначения();
			КонецЕсли;
			Для Каждого ъ Из Значение Цикл
				Таблица.Добавить()[0] = ъ;
			КонецЦикла;
			НовыйКонтейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Таблица);
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 3 Тогда
			Контейнер = ТипЗначения;
			//Теперь не копируем, преобразование уже выполняет редактор типа!
			//СкопироватьДанныеКонтейнераТипа3(Контейнер, СтрокаПараметр.Контейнер);
			НовыйКонтейнер = Контейнер;
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 0 Тогда
			Таблица = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(ТипЗначения);
			Таблица.Добавить()[0] = СтрокаПараметр.Значение;
			НовыйКонтейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Таблица);
		КонецЕсли;

		СтрокаПараметр.Контейнер = НовыйКонтейнер;

	ИначеЕсли ТипКонтейнера = 0 Тогда

		Если СтрокаПараметр.ТипКонтейнера = 1 Или СтрокаПараметр.ТипКонтейнера = 2 Тогда
			КонтейнерМассив = Контейнер12ВМассив(Контейнер);
			Если КонтейнерМассив.Количество() > 0 Тогда
				СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(
					ТипЗначения.ПривестиЗначение(КонтейнерМассив[0]));
			КонецЕсли;
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 3 Тогда
			СписокЗначений = ТаблицаФормаПриИзмененииСЗИзТЗ(Контейнер);
			Если СписокЗначений.Количество() > 0 Тогда
				СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(
					ТипЗначения.ПривестиЗначение(СписокЗначений.СписокЗначений[0].Значение));
			КонецЕсли;
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 0 Тогда
			СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(
				ТипЗначения.ПривестиЗначение(РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(
				СтрокаПараметр.Контейнер)));
		КонецЕсли;

	КонецЕсли;

	СтрокаПараметр.ТипКонтейнера = ТипКонтейнера;
	Если СтрокаПараметр.ТипКонтейнера = 3 Тогда
		СтрокаПараметр.ТипЗначения = "Таблица значений";
	Иначе
		СтрокаПараметр.ТипЗначения = ТипЗначения;
	КонецЕсли;

	Модифицированность = Истина;

	Если ТипЗнч(СтрокаПараметр.Контейнер) = Тип("Структура") Тогда
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер.Представление;
	Иначе
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер;
	КонецЕсли;

КонецПроцедуры

&НаСервере
//Контейнер типа 1 и типа 2 (список значений или массив) возвращаем в виде массива
Функция Контейнер12ВМассив(Контейнер)

	Значение = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер);

	Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		Возврат Значение.ВыгрузитьЗначения();
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
		Возврат Значение;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

&НаСервере
Функция ТаблицаФормаПриИзмененииСЗИзТЗ(Контейнер)

	ТзТаблица = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер);
	СзСписок = Новый СписокЗначений;
	Если ТзТаблица.Колонки.Количество() > 0 Тогда
		СзСписок.ЗагрузитьЗначения(тзТаблица.ВыгрузитьКолонку(0));
	КонецЕсли;

	Возврат РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(СзСписок);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НужнаКнопкаВыбораЗначению(Значение)

	МассивТипыБезКнопкиВыбора = Новый Массив;
	МассивТипыБезКнопкиВыбора.Добавить(Тип("Строка"));
	МассивТипыБезКнопкиВыбора.Добавить(Тип("Число"));
	МассивТипыБезКнопкиВыбора.Добавить(Тип("Булево"));
	МассивТипыБезКнопкиВыбора.Добавить(Тип("ВидДвиженияНакопления"));
	МассивТипыБезКнопкиВыбора.Добавить(Тип("ВидДвиженияБухгалтерии"));
	МассивТипыБезКнопкиВыбора.Добавить(Тип("ВидСчета"));
	ТипыБезКнопкийВыбора = Новый ОписаниеТипов(МассивТипыБезКнопкиВыбора);

	Возврат Не ТипыБезКнопкийВыбора.СодержитТип(ТипЗнч(Значение));

КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеИмениПараметра(НоваяСтрока, ОтменаРедактирования, Отказ, ИмяТаблицы)

	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;

	СтрИмяПараметра = Элементы[ИмяТаблицы].ТекущиеДанные.Имя;
	Если ЗначениеЗаполнено(СтрИмяПараметра) И СтрИмяПараметра = СтароеЗначениеИмяПараметра Тогда
		Возврат;
	КонецЕсли;

	Если Не ИмяКорректно(СтрИмяПараметра) Тогда
		//ПоказатьПредупреждениеКонсоли(
		//	"Неверное имя параметра! Имя должно состоять из одного слова, начинаться с буквы и не содержать специальных символов кроме ""_"".");   

		//@skip-check use-non-recommended-method
		Сообщить(
			"Неверное имя параметра! Имя должно состоять из одного слова, начинаться с буквы и не содержать специальных символов кроме ""_"".");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуДополнительнойОбработкиПоИмени(ИмяОбъекта)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
				   |ИЗ
				   |	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
				   |ГДЕ
				   |	ДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта";
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкиКомандыПоУмолчаниюНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьНастройкиКомандыПоУмолчанию(НастройкиКоманды, ИдентификаторКоманды,
		РежимЗагрузкиНастроекПоУмолчанию);
	ОбработкаОбъект.ЗагрузитьНастройкиКомандыБезопасноеХранилищеПоУмолчанию(НастройкиКомандыБезопасноеХранилище,
		ИдентификаторКоманды, РежимЗагрузкиНастроекПоУмолчанию);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиОБработкиПоУмолчаниюНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьНастройкиОбработкиПоУмолчанию(НастройкиОбработки, РежимЗагрузкиНастроекПоУмолчанию);
	ОбработкаОбъект.ЗагрузитьНастройкиОбработкиБезопасноеХранилищеПоУмолчанию(НастройкиОбработкиБезопасноеХранилище,
		РежимЗагрузкиНастроекПоУмолчанию);

КонецПроцедуры
&НаСервере
Процедура ЭкспортироватьНастройкиНаСервере(АдресФайла)


	//@skip-check reading-attribute-from-database
	НастройкиИзХранилищаНастроекОбработки = ДополнительнаяОбработка.ХранилищеНастроек.Получить();
	НастройкиИзБезопасногоХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ДополнительнаяОбработка);

	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ИмяОбработки", ИмяОбработки);
	СтруктураНастроек.Вставить("ДатаСохраненияНастроек", ТекущаяДатаСеанса());
	СтруктураНастроек.Вставить("НастройкиИзХранилищаНастроекОбработки", НастройкиИзХранилищаНастроекОбработки);
	СтруктураНастроек.Вставить("НастройкиИзБезопасногоХранилища", НастройкиИзБезопасногоХранилища);

	ТекстНастроек = ЗначениеВСтрокуВнутр(СтруктураНастроек);

	ПотокВПамяти = Новый ПотокВПамяти;

	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(ТекстНастроек);
	ТекстДок.Записать(ПотокВПамяти);

	АдресФайла = ПоместитьВоВременноеХранилище(ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные(), УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьНастройкиНаСервере(АдресФайла)
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);

	ПотокВПамяти = Новый ПотокВПамяти;
	ЗаписьДанных = Новый ЗаписьДанных(ПотокВПамяти);
	ЗаписьДанных.Записать(ДвоичныеДанные);
	ЗаписьДанных.Закрыть();
	ПотокВПамяти.Перейти(0, ПозицияВПотоке.Начало);

	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПотокВПамяти, КодировкаТекста.UTF8);
	ТекстНастроек = ТекстДок.ПолучитьТекст();

	Попытка
		СтруктураНастроек = ЗначениеИзСтрокиВнутр(ТекстНастроек);
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			
			
			// Сохранение в хранилище обработки

			ДополнительнаяОбработкаОбъект = ДополнительнаяОбработка.ПолучитьОбъект();
			ДополнительнаяОбработкаОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(СтруктураНастроек.НастройкиИзХранилищаНастроекОбработки);
			ДополнительнаяОбработкаОбъект.Записать(); 
	
			// Сохранение в безопасное хранилище
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ДополнительнаяОбработка,
				СтруктураНастроек.НастройкиИзБезопасногоХранилища);

			ПрочитатьНастройкиОбработкиНаСервере();

		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Файл содержит настройки неподдерживаемого формата!";
			Сообщение.Сообщить();

		КонецЕсли;

	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл содержит настройки неподдерживаемого формата!";
		Сообщение.Сообщить();
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ОчиститьНастройкиНаСервере()
	// Сохранение в хранилище обработки

	ДополнительнаяОбработкаОбъект = ДополнительнаяОбработка.ПолучитьОбъект();
	ДополнительнаяОбработкаОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(Новый Структура);
	ДополнительнаяОбработкаОбъект.Записать(); 
	
			// Сохранение в безопасное хранилище
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ДополнительнаяОбработка, Новый Структура);

	ПрочитатьНастройкиОбработкиНаСервере();

КонецПроцедуры
#КонецОбласти