// Обработка создана на базе проекта `Шаблон дополнительной обработки для конфигураций 1с на основе БСП`
// Документация и новые версии шаблона доступны по ссылке 
// https://github.com/ilko-os/1c-additional-data-processor-template
// RELEASE-2026.3.17.1

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ОбработкаСсылка;								// Ссылка на данную обработку
Перем ПараметрыЛогирования;							// Используется для подсистемы логирования


// Переменные для доступа к настрйкам обработки из кода
// см. документацию https://github.com/ilko-os/1c-additional-data-processor-template?tab=readme-ov-file#access-to-settings-in-the-code
Перем НастройкиОбработки; 							
Перем НастройкиОбработкиБезопасноеХранилище; 		
Перем НастройкиКоманды; 							
Перем НастройкиКомандыБезопасноеХранилище; 			

Перем ПараметрыКоманды;

Перем НастройкиКомандИОбработки;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Формирует сведения о внешнем отчете или обработке.
//
// Возвращаемое значение:
//   Структура - параметры внешнего отчета или обработки:
//       * Вид - ПеречислениеСсылка.ВидыДополнительныхОтчетовИОбработок 
//             - Строка - вид внешнего отчета или обработки. Для указания вида рекомендуется использовать функции
//           ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработки<ИмяВида>.
//           Также вид можно указать явно:
//           "ПечатнаяФорма",
//           "ЗаполнениеОбъекта",
//           "СозданиеСвязанныхОбъектов",
//           "Отчет",
//           "ШаблонСообщения",
//           "ДополнительнаяОбработка",
//           "ДополнительныйОтчет".
//       
//       * Версия - Строка - версия отчета или обработки (далее - обработки).
//           Задается в формате: "<Старший номер>.<Младший номер>".
//       
//       * Назначение - Массив из Строка - полные имена объектов конфигурации (Строка), для которых предназначен эта обработка.
//                               Необязательное свойство.
//       
//       * Наименование - Строка - представление для администратора (наименование элемента справочника).
//                                 Если не заполнено, то берется представление объекта метаданных внешней обработки.
//                                 Необязательное свойство. 
//       
//       * БезопасныйРежим - Булево - признак подключения внешней обработки в безопасном режиме.
//                                    Значение по умолчанию Истина (обработка будет выполняться безопасно).
//                                    В безопасном режиме:
//                                     Игнорируется привилегированный режим.
//                                     Запрещены внешние по отношению к платформе 1С:Предприятия действия:
//                                      COM;
//                                      загрузка внешних компонент;
//                                      запуск внешних приложений и команд операционной системы;
//                                      доступ к файловой системе, кроме временных файлов;
//                                      доступ к Интернету.
//                                    Необязательное свойство.
//       
//       * Разрешения - Массив из ОбъектXDTO - дополнительные разрешения, необходимые внешней обработке при работе в
//                               безопасном режиме. Элемент массива - ОбъектXDTO - разрешение типа
//                               {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}PermissionBase.
//                               Для формирования описания разрешения рекомендуется использовать функции
//                               РаботаВБезопасномРежиме.Разрешение<ВидРазрешения>(<ПараметрыРазрешения>).
//                               Необязательное свойство.
//       
//       * Информация - Строка - краткая информация о внешней обработке.
//                               В этом параметре для администратора рекомендуется дать описание ее возможностей.
//                               Если не заполнено, то берется комментарий объекта метаданных внешней обработки.
//       
//       * ВерсияБСП - см. СтандартныеПодсистемыСервер.ВерсияБиблиотеки.
//       
//       * ОпределитьНастройкиФормы - Булево - только для дополнительных отчетов, подключенных к общей форме ФормаОтчета.
//                                             Позволяет переопределять некоторые настройки общей формы отчета и 
//                                             подписываться на ее события.
//                                             Если Истина, то в модуле объекта отчета следует определить процедуру по шаблону:
//       
//       * НазначениеВариантаОтчета - ПеречислениеСсылка.НазначенияВариантовОтчетов - назначение варианта отчета
//										(ДляКомпьютеровИПланшетов, ДляСмартфонов, ДляЛюбыхУстройств).
//           
//           // Задать настройки формы отчета.
//           //
//           // Параметры:
//           //   Форма - ФормаКлиентскогоПриложения, Неопределено
//           //   КлючВарианта - Строка, Неопределено
//           //   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//           //
//           Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
//           	// Код процедуры.
//           КонецПроцедуры
//           
//           Подробнее см. в документации к подсистемам "Дополнительные отчеты и обработки" и "Варианты отчетов".
//           Необязательное свойство.
//       
//       * Команды - ТаблицаЗначений - настройки команд, поставляемых внешней обработкой (необязательно для отчетов):
//           ** Идентификатор - Строка - внутреннее имя команды. Для внешних печатных форм (когда Вид = "ПечатнаяФорма"):
//                 Идентификатор может содержать имена одной или нескольких команд печати,
//                 разделенные запятыми. Подробнее см. описание колонки Идентификатор
//                 в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//           ** Представление - Строка - пользовательское представление команды.
//           ** Использование - Строка - тип команды:
//               "ВызовКлиентскогоМетода",
//               "ВызовСерверногоМетода",
//               "ЗаполнениеФормы",
//               "ОткрытиеФормы" или
//               "СценарийВБезопасномРежиме".
//               Для получения типов команд рекомендуется использовать функции
//               ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКоманды<ИмяТипа>.
//               В комментариях к этим функциям также даны шаблоны процедур-обработчиков команд.
//           ** ПоказыватьОповещение - Булево - если Истина, то при запуске команды выводится оповещение "Команда выполняется...".
//              Действует для всех типов команд, кроме команд по открытию формы (Использование = "ОткрытиеФормы").
//           ** Модификатор - Строка - дополнительная классификация команды.
//               Для внешних печатных форм (когда Вид = "ПечатнаяФорма"):
//                 "ПечатьMXL" - для печатных форм на основе табличных макетов.
//               Для загрузки данных из файла (когда Вид = "ПечатнаяФорма" и Использование = "ЗагрузкаДанныхИзФайла"):
//                 Модификатор является обязательным для заполнения
//                 и должен содержать полное имя объекта метаданных (справочника),
//                 для которого выполняется загрузка данных.
//           ** Скрыть - Булево - необязательный. Признак того, что это служебная команда.
//               Если установить в значение Истина, то команда скрывается в карточке дополнительного объекта.
//
Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	// Начало области для модификации {{ 
	ПараметрыРегистрации.Версия = "2026.3.6.1";
	ПараметрыРегистрации.Информация = "Шаблон дополнительной обработки";  
	// }} Окончание области для модификации
	ПараметрыРегистрации.БезопасныйРежим = Ложь;

	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Форма настроек'");
	Команда.Идентификатор = "ОткрытьФормуНастроек";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;


	// Начало области для модификации {{ 
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Команда 1'");
	Команда.Идентификатор = "Команда1";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Команда.ПоказыватьОповещение = Истина;

	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Команда 2'");
	Команда.Идентификатор = "Команда2";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Команда.ПоказыватьОповещение = Истина;

	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Команда 3'");
	Команда.Идентификатор = "Команда3";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Команда.ПоказыватьОповещение = Истина;
	// }} Окончание области для модификации
	

	Возврат ПараметрыРегистрации;

КонецФункции


// Выполнить команду.
// Для глобальных отчетов и обработок (Вид = "ДополнительнаяОбработка" или Вид = "ДополнительныйОтчет"):
// 
// Параметры:
//  ИдентификаторКоманды  - Строка    - имя команды, определенное в функции СведенияОВнешнейОбработке().
//  ПараметрыВыполнения  - Структура - контекст выполнения команды
//		* ДополнительнаяОбработкаСсылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - ссылка на обработку.
//			Может использоваться для чтения параметров обработки.
//			Пример см. в комментарии к функции ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы().
//		* РезультатВыполнения - Структура - результат выполнения команды.
//      	Может использоваться для передачи результата с сервера или из фонового задания в исходную точку.
//      	В частности, возвращается функциями ДополнительныеОтчетыИОбработки.ВыполнитьКоманду()
//      	и ДополнительныеОтчетыИОбработки.ВыполнитьКомандуИзФормыВнешнегоОбъекта(),
//     		а также может быть получено из временного хранилища
//     		в обработчике ожидания процедуры ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьКомандуВФоне().
//@skip-check doc-comment-field-in-description-suggestion
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполнения) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ЕстьОшибки = Ложь;

	ИмяОбработки = Метаданные().Имя;
	ИмяСобытия = СтрШаблон("ДополнительныеОтчетыИОбработки.%1.%2", ИмяОбработки, ИдентификаторКоманды);

	ПараметрыЛогирования = ПолучитьПараметрыЛогирования(ИмяСобытия);
	ОбработкаСсылка = ПараметрыВыполнения.ДополнительнаяОбработкаСсылка;

	ЗаписатьСобытиеВЖурналРегистрации("Начало выполнения.", , , ОбработкаСсылка);

	ЗаписатьСобытиеВЖурналРегистрации("Начало чтения настроек.", , , ОбработкаСсылка);

	ПрочитатьНастройки(ИдентификаторКоманды, ОбработкаСсылка, ЕстьОшибки);

	ЗаписатьСобытиеВЖурналРегистрации("Окончание чтения настроек.", , , ОбработкаСсылка);

	// Начало области для модификации {{
	Если ИдентификаторКоманды = "Команда1" Тогда

		Команда1();

	ИначеЕсли ИдентификаторКоманды = "Команда2" Тогда

		Команда2();

	ИначеЕсли ИдентификаторКоманды = "Команда3" Тогда

		Команда3();

	Иначе

		ЗаписатьСобытиеВЖурналРегистрации("Для команды не задан обработчик.", , , ОбработкаСсылка);

	КонецЕсли;
	// }} Окончание области для модификации
	ЗаписатьСобытиеВЖурналРегистрации("Окончание выполнения.", , , ОбработкаСсылка);

КонецПроцедуры

// Удалить, нужна для совместимости на проекте
//@skip-check doc-comment-export-function-return-section
Функция ИдентификаторыПараметровОбъектов() Экспорт

	Массив = Новый Массив;
	Возврат Массив;

КонецФункции
#КонецОбласти
#Область СлужебныйПрограммныйИнтерфейс

#Область ЗагрузкаНастройкиПоУмолчанию


// Загрузить настройки обработки по умолчанию.
// 
// Параметры:
//  НастройкиОбработки - ТаблицаЗначений - соответствует одноименному реквизиту на форме
//  РежимЗагрузкиНастроекПоУмолчанию - Строка - Определяет режим добавления строк: "Обновление", "ДобавлениеНовых", 
//		"Замещение"  
Процедура ЗагрузитьНастройкиОбработкиПоУмолчанию(НастройкиОбработки, РежимЗагрузкиНастроекПоУмолчанию) Экспорт

	Если РежимЗагрузкиНастроекПоУмолчанию = "Замещение" Тогда
		НастройкиОбработки.Очистить();
	КонецЕсли;

	Имя       = "Сервер";
	ТипКонтейнера = 0;
	ТипЗначения = Новый ОписаниеТипов("Строка");
	Значение  = "jsonplaceholder.typicode.com";
	Описание  = "Тип: Строка. Путь к серверу. DNS-имя или IP";
	ДобавитьСтрокуСНастройкой(НастройкиОбработки, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
		РежимЗагрузкиНастроекПоУмолчанию);

	Имя       = "Порт";
	ТипКонтейнера = 0;
	ТипЗначения = Новый ОписаниеТипов("Число");
	Значение  = 443;
	Описание  = "Тип: Число. Порт сервера";
	ДобавитьСтрокуСНастройкой(НастройкиОбработки, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
		РежимЗагрузкиНастроекПоУмолчанию);

	Имя       = "ЗащищенноеСоединение";
	ТипКонтейнера = 0;
	ТипЗначения = Новый ОписаниеТипов("Булево");
	Значение  = Истина;
	Описание  = "Тип: Булево. Использовать защищенное соединение (https)";
	ДобавитьСтрокуСНастройкой(НастройкиОбработки, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
		РежимЗагрузкиНастроекПоУмолчанию);

КонецПроцедуры

// Загрузить настройки обработки безопасное хранилище по умолчанию.
// 
// Параметры:
//  НастройкиОбработкиБезопасноеХранилище - ТаблицаЗначений - соответствует одноименному реквизиту на форме
//  РежимЗагрузкиНастроекПоУмолчанию - Строка - Определяет режим добавления строк: "Обновление", "ДобавлениеНовых", "Замещение"
Процедура ЗагрузитьНастройкиОбработкиБезопасноеХранилищеПоУмолчанию(НастройкиОбработкиБезопасноеХранилище,
	РежимЗагрузкиНастроекПоУмолчанию) Экспорт

	Если НастройкиОбработкиБезопасноеХранилище = "Замещение" Тогда
		НастройкиОбработкиБезопасноеХранилище.Очистить();
	КонецЕсли;

	Имя       = "Пользователь";
	ТипКонтейнера = 0;
	ТипЗначения = Новый ОписаниеТипов("Строка");
	Значение  = "";
	Описание  = "Тип: Строка. Пользователь";
	ДобавитьСтрокуСНастройкой(НастройкиОбработкиБезопасноеХранилище, Имя, ТипКонтейнера, ТипЗначения, Значение,
		Описание, РежимЗагрузкиНастроекПоУмолчанию);

	Имя       = "Пароль";
	ТипКонтейнера = 0;
	ТипЗначения = Новый ОписаниеТипов("Строка");
	Значение  = "";
	Описание  = "Тип: Строка. Пароль";
	ДобавитьСтрокуСНастройкой(НастройкиОбработкиБезопасноеХранилище, Имя, ТипКонтейнера, ТипЗначения, Значение,
		Описание, РежимЗагрузкиНастроекПоУмолчанию);
		
		
	// Таблица значений
	Имя       		= "ТаблицаApiKey";
	ТипКонтейнера 	= 3;
	ТипЗначения 	= "Таблица значений";
	Значение  = Новый ТаблицаЗначений;
	Значение.Колонки.Добавить("Аккаунт", Новый ОписаниеТипов("СправочникСсылка._ДемоОрганизации"), "Аккаунт");
	Значение.Колонки.Добавить("ApiKey", Новый ОписаниеТипов("Строка"), "Api Key");
	Значение.Колонки.Добавить("ПсевдонимApiKey", Новый ОписаниеТипов("Строка"), "Псевдоним Api Key");
	Значение.Колонки.Добавить("ДействуетДо", Новый ОписаниеТипов("Дата"), "Действует до");
	Описание  = "Ключи для доступа к API и сроки их действия";
	ДобавитьСтрокуСНастройкой(НастройкиОбработкиБезопасноеХранилище, Имя, ТипКонтейнера, ТипЗначения, Значение,
		Описание, РежимЗагрузкиНастроекПоУмолчанию);

КонецПроцедуры

// Загрузить настройки команды по умолчанию.
// 
// Параметры:
//  НастройкиКоманды  - ТаблицаЗначений - соответствует одноименному реквизиту на форме
//  ИдентификаторКоманды - Строка - Идентификатор команды определенный в функции "СведенияОВнешнейОбработке()"
//  РежимЗагрузкиНастроекПоУмолчанию - Строка - Определяет режим добавления строк: "Обновление", "ДобавлениеНовых", "Замещение" 
Процедура ЗагрузитьНастройкиКомандыПоУмолчанию(НастройкиКоманды, ИдентификаторКоманды,
	РежимЗагрузкиНастроекПоУмолчанию) Экспорт

	Если РежимЗагрузкиНастроекПоУмолчанию = "Замещение" Тогда
		НастройкиКоманды.Очистить();
	КонецЕсли;
	Если ИдентификаторКоманды = "Команда1" Тогда     
		
		// Строка
		Имя       =	"ПутьКМетоду";
		ТипКонтейнера = 0;
		ТипЗначения = Новый ОписаниеТипов("Строка");
		Значение  = "/comments";
		Описание  = "Путь к методу на сервере";
		ТипКонтейнера = 0;
		ДобавитьСтрокуСНастройкой(НастройкиКоманды, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
			РежимЗагрузкиНастроекПоУмолчанию);  
		
		// Число
		Имя       =	"Таймаут";
		ТипКонтейнера = 0;
		ТипЗначения = Новый ОписаниеТипов("Число");
		Значение  = 1500;
		Описание  = "Таймаут";
		ДобавитьСтрокуСНастройкой(НастройкиКоманды, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
			РежимЗагрузкиНастроекПоУмолчанию); 
		
		// Булево
		Имя       =	"ИспользоватьЛогирование";
		ТипКонтейнера = 0;
		ТипЗначения = Новый ОписаниеТипов("Булево");
		Значение  = Истина;
		Описание  = "Использовать логирование событий";
		ДобавитьСтрокуСНастройкой(НастройкиКоманды, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
			РежимЗагрузкиНастроекПоУмолчанию);   
		
		// Дата
		Имя       =	"ДатаНачалаЗагрузкиКомментариев";
		ТипКонтейнера = 0;
		ТипЗначения = Новый ОписаниеТипов("Дата");
		Значение  = Дата(2024, 1, 1);
		Описание  = "Дата начала загрузки комментариев";
		ДобавитьСтрокуСНастройкой(НастройкиКоманды, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
			РежимЗагрузкиНастроекПоУмолчанию); 
		
		// Ссылочный тип
		Имя       =	"УзелОбмена";
		ТипКонтейнера = 0;
		ТипЗначения = Новый ОписаниеТипов("ПланОбменаСсылка._ДемоОбменВРаспределеннойИнформационнойБазе");
		Значение  = ПланыОбмена._ДемоОбменВРаспределеннойИнформационнойБазе.ПустаяСсылка();
		Описание  = "Узел обмена";
		ДобавитьСтрокуСНастройкой(НастройкиКоманды, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
			РежимЗагрузкиНастроекПоУмолчанию);          
		
		// Список значений из Ссылочных типов
		Имя       =	"Валюты";
		ТипКонтейнера = 1;
		ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Валюты");
		Значение  = Новый СписокЗначений;
		Описание  = "Тип: СправочникСсылка.Валюты. Перечень валют для выгрузки";
		ДобавитьСтрокуСНастройкой(НастройкиКоманды, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
			РежимЗагрузкиНастроекПоУмолчанию);
		
		// Массив из Ссылочных типов
		Имя       =	"ВидыЦен";
		ТипКонтейнера = 2;
		ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		Значение  = Контейнер_СохранитьЗначение(Новый Массив);
		Описание  = "Тип: СправочникСсылка.Пользователи. Перечень пользователей для выгрузки";
		ДобавитьСтрокуСНастройкой(НастройкиКоманды, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
			РежимЗагрузкиНастроекПоУмолчанию);

		// Таблица значений
		Имя       =	"ТаблицаСоответствияПользователейИВалют";
		ТипКонтейнера = 3;
		ТипЗначения = "Таблица значений";
		Значение  = Новый ТаблицаЗначений;
		Значение.Колонки.Добавить("Пользователи", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), "Пользователи");
		Значение.Колонки.Добавить("Валюты", Новый ОписаниеТипов("СправочникСсылка.Валюты"), "Валюты расчета");
		Значение.Колонки.Добавить("ПорядокСортировки", Новый ОписаниеТипов("Число"), "Порядок сортировки");
		//стр = Значение.Добавить();
		//стр.Склад = Справочники.Склады.ПустаяСсылка();
		//стр.ПорядокСортировки = 1;
		Описание  = "Тип: СправочникСсылка.ВидыЦен. Перечень видов цен для выгрузки";
		ДобавитьСтрокуСНастройкой(НастройкиКоманды, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
			РежимЗагрузкиНастроекПоУмолчанию);  
		
		// Составной тип
		// Массив из составных типов
		Имя       =	"ПараметрСоставногоТипа";
		ТипКонтейнера = 2;
		//@skip-check bsl-variable-name-invalid
		КЧ = Новый КвалификаторыЧисла(12, 2);
		//@skip-check bsl-variable-name-invalid
		КС = Новый КвалификаторыСтроки(20);
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		МассивТипов.Добавить(Тип("Дата"));
		МассивТипов.Добавить(Тип("СправочникСсылка.Пользователи"));
		МассивТипов.Добавить(Тип("СправочникСсылка.Валюты"));
		МассивТипов.Добавить(Тип("ДокументСсылка.АктОбУничтоженииПерсональныхДанных"));
		ТипЗначения = Новый ОписаниеТипов(МассивТипов, , , КЧ, КС);
		Значение  = Контейнер_СохранитьЗначение(Новый Массив);
		Описание  = "Пример параметра составного типа";
		ДобавитьСтрокуСНастройкой(НастройкиКоманды, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
			РежимЗагрузкиНастроекПоУмолчанию);
	ИначеЕсли ИдентификаторКоманды = "Команда2" Тогда

		Имя       =	"ПутьКМетоду";
		ТипКонтейнера = 0;
		ТипЗначения = Новый ОписаниеТипов("Строка");
		Значение  = "/todos";
		Описание  = "Путь к методу на сервере";
		ТипКонтейнера = 0;
		ДобавитьСтрокуСНастройкой(НастройкиКоманды, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
			РежимЗагрузкиНастроекПоУмолчанию);

	ИначеЕсли ИдентификаторКоманды = "Команда3" Тогда

		Имя       =	"ПутьКМетоду";
		ТипКонтейнера = 0;
		ТипЗначения = Новый ОписаниеТипов("Строка");
		Значение  = "/posts";
		Описание  = "Путь к методу на сервере";
		ТипКонтейнера = 0;
		ДобавитьСтрокуСНастройкой(НастройкиКоманды, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
			РежимЗагрузкиНастроекПоУмолчанию);

	КонецЕсли;
КонецПроцедуры

// Загрузить настройки команды безопасное хранилище по умолчанию.
// 
// Параметры:
//  НастройкиКомандыБезопасноеХранилище - ТаблицаЗначений - соответствует одноименному реквизиту на форме
//  ИдентификаторКоманды - Строка - Идентификатор команды определенный в функции "СведенияОВнешнейОбработке()"
//  РежимЗагрузкиНастроекПоУмолчанию - Строка - Определяет режим добавления строк: "Обновление", "ДобавлениеНовых", "Замещение" 
Процедура ЗагрузитьНастройкиКомандыБезопасноеХранилищеПоУмолчанию(НастройкиКомандыБезопасноеХранилище,
	ИдентификаторКоманды, РежимЗагрузкиНастроекПоУмолчанию) Экспорт

	Если РежимЗагрузкиНастроекПоУмолчанию = "Замещение" Тогда
		НастройкиКомандыБезопасноеХранилище.Очистить();
	КонецЕсли;
	Если ИдентификаторКоманды = "Команда1" Тогда

		Имя       =	"ApiKey";
		ТипКонтейнера = 0;
		ТипЗначения = Новый ОписаниеТипов("Строка");
		Значение  = "";
		Описание  = "Строка. Ключ для доступа к методу";
		ДобавитьСтрокуСНастройкой(НастройкиКомандыБезопасноеХранилище, Имя, ТипКонтейнера, ТипЗначения, Значение,
			Описание, РежимЗагрузкиНастроекПоУмолчанию);

	ИначеЕсли ИдентификаторКоманды = "Команда2" Тогда

	ИначеЕсли ИдентификаторКоманды = "Команда3" Тогда

	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область Контейнер

Функция СуффиксРеквизитаКонтейнера() Экспорт
	Возврат "_31415926Контейнер";
КонецФункции

//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция Контейнер_Очистить(Контейнер) Экспорт

	Если Контейнер.Тип = "ТаблицаЗначений" Тогда
		Значение = Контейнер_ВосстановитьЗначение(Контейнер);
		Значение.Очистить();
	ИначеЕсли Контейнер.Тип = "СписокЗначений" Тогда
		Значение = Контейнер_ВосстановитьЗначение(Контейнер);
		Значение.Очистить();
	ИначеЕсли Контейнер.Тип = "Массив" Тогда
		Значение = Новый Массив;
	ИначеЕсли Контейнер.Тип = "Тип" Тогда
		Значение = Тип("Неопределено");
	ИначеЕсли Контейнер.Тип = "Граница" Тогда
		Значение = Новый Граница(, ВидГраницы.Включая);
	ИначеЕсли Контейнер.Тип = "МоментВремени" Тогда
		Значение = Новый МоментВремени('00010101');
	ИначеЕсли Контейнер.Тип = "ХранилищеЗначения" Тогда
		Значение = Новый ХранилищеЗначения(Неопределено);
	Иначе
		ВызватьИсключение "Неизвестный тип контейнера";
	КонецЕсли;

	Контейнер_СохранитьЗначение(Значение);

КонецФункции

Функция Контейнер_СохранитьЗначение(Значение) Экспорт

	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Граница") Тогда
		//@skip-check structure-consructor-too-many-keys
		Результат = Новый Структура("Тип, ВидГраницы, Значение, Представление", "Граница");
		ЗаполнитьЗначенияСвойств(Результат, Значение);
		Результат.ВидГраницы = Строка(Результат.ВидГраницы);
		Результат.Представление = Контейнер_ПолучитьПредставление(Результат);
	ИначеЕсли ТипЗначения = Тип("МоментВремени") Тогда
		//@skip-check structure-consructor-too-many-keys
		Результат = Новый Структура("Тип, Дата, Ссылка, Представление", "МоментВремени");
		ЗаполнитьЗначенияСвойств(Результат, Значение);
		Результат.Представление = Контейнер_ПолучитьПредставление(Результат);
	ИначеЕсли ТипЗначения = Тип("Тип") Тогда
		Результат = Новый Структура("Тип, ИмяТипа, Представление", "Тип", ПолучитьИмяТипа(Значение));
		Результат.Представление = Контейнер_ПолучитьПредставление(Результат);
	ИначеЕсли ТипЗначения = Тип("ХранилищеЗначения") Тогда
		Результат = Новый Структура("Тип, Хранилище, Представление", "ХранилищеЗначения", ЗначениеВСтроку(Значение));
		Результат.Представление = Контейнер_ПолучитьПредставление(Результат);
	ИначеЕсли ТипЗначения = Тип("Массив") Тогда
		Результат = Новый Структура("Тип, СписокЗначений, Представление", "Массив", СписокЗначенийИзМассива(Значение));
		Результат.Представление = Контейнер_ПолучитьПредставление(Результат);
	ИначеЕсли ТипЗначения = Тип("СписокЗначений") Тогда
		Результат = Новый Структура("Тип, СписокЗначений, Представление", "СписокЗначений", Значение);
		Результат.Представление = Контейнер_ПолучитьПредставление(Результат);
	ИначеЕсли ТипЗначения = Тип("ТаблицаЗначений") Тогда
		//@skip-check structure-consructor-too-many-keys
		Результат = Новый Структура("Тип, КоличествоСтрок, Значение, Представление", "ТаблицаЗначений",
			Значение.Количество(), ЗначениеВСтроку(Значение));
		Результат.Представление = Контейнер_ПолучитьПредставление(Результат);
	Иначе
		Результат = Значение;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция Контейнер_ВосстановитьЗначение(СохраненноеЗначение) Экспорт

	Если ТипЗнч(СохраненноеЗначение) = Тип("Структура") Тогда
		Если СохраненноеЗначение.Тип = "Граница" Тогда
			Результат = Новый Граница(СохраненноеЗначение.Значение, ВидГраницы[СохраненноеЗначение.ВидГраницы]);
		ИначеЕсли СохраненноеЗначение.Тип = "МоментВремени" Тогда
			Результат = Новый МоментВремени(СохраненноеЗначение.Дата, СохраненноеЗначение.Ссылка);
		ИначеЕсли СохраненноеЗначение.Тип = "ХранилищеЗначения" Тогда
			Результат = СохраненноеЗначение.Хранилище;
		ИначеЕсли СохраненноеЗначение.Тип = "Тип" Тогда
			Результат = Тип(СохраненноеЗначение.ИмяТипа);
		ИначеЕсли СохраненноеЗначение.Тип = "СписокЗначений" Тогда
			Результат = СохраненноеЗначение.СписокЗначений;
		ИначеЕсли СохраненноеЗначение.Тип = "Массив" Тогда
			Результат = СохраненноеЗначение.СписокЗначений.ВыгрузитьЗначения();
		ИначеЕсли СохраненноеЗначение.Тип = "ТаблицаЗначений" Тогда
			Результат = СтрокаВЗначение(СохраненноеЗначение.Значение);
		КонецЕсли;
	Иначе
		Результат = СохраненноеЗначение;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция Контейнер_ПолучитьПредставление(Контейнер) Экспорт

	РазмерПредставления = 200;

	Если ТипЗнч(Контейнер) = Тип("Структура") Тогда
		Если Контейнер.Тип = "Граница" Тогда
			Возврат Строка(Контейнер.Значение) + " " + Контейнер.ВидГраницы;
		ИначеЕсли Контейнер.Тип = "Массив" Тогда
			Возврат Лев(СтрСоединить(Контейнер.СписокЗначений.ВыгрузитьЗначения(), "; "), РазмерПредставления);
		ИначеЕсли Контейнер.Тип = "СписокЗначений" Тогда
			Возврат Лев(СтрСоединить(Контейнер.СписокЗначений.ВыгрузитьЗначения(), "; "), РазмерПредставления);
		ИначеЕсли Контейнер.Тип = "ТаблицаЗначений" Тогда
			КоличествоСтрок = Неопределено;
			Если Контейнер.Свойство("КоличествоСтрок", КоличествоСтрок) Тогда
				Возврат "<строк: " + КоличествоСтрок + ">";
			Иначе
				Возврат "<строк: ?>";
			КонецЕсли;
		ИначеЕсли Контейнер.Тип = "МоментВремени" Тогда
			Возврат Строка(Контейнер.Дата) + "; " + Контейнер.Ссылка;
		ИначеЕсли Контейнер.Тип = "Тип" Тогда
			Возврат "Тип: " + Тип(Контейнер.ИмяТипа);
		ИначеЕсли Контейнер.Тип = "ХранилищеЗначения" Тогда
			Возврат "<ХранилищеЗначения>";
		КонецЕсли;
	Иначе
		Возврат "???";
	КонецЕсли;

КонецФункции

#КонецОбласти
#Область Прочее

Функция ПолучитьИмяКартинкиТипа(Значение) Экспорт

	Если Значение = "Таблица значений" Тогда
		Возврат "Тип_ТаблицаЗначений";
	ИначеЕсли Значение = Тип("Массив") Тогда
		Возврат "Тип_Массив";
	ИначеЕсли Значение = Тип("СписокЗначений") Тогда
		Возврат "Тип_СписокЗначений";
	ИначеЕсли Значение = Тип("Строка") Тогда
		Возврат "Тип_Строка";
	ИначеЕсли Значение = Тип("Число") Тогда
		Возврат "Тип_Число";
	ИначеЕсли Значение = Тип("Булево") Тогда
		Возврат "Тип_Булево";
	ИначеЕсли Значение = Тип("Дата") Тогда
		Возврат "Тип_Дата";
	ИначеЕсли Значение = Тип("Граница") Тогда
		Возврат "Тип_Граница";
	ИначеЕсли Значение = Тип("МоментВремени") Тогда
		Возврат "Тип_МоментВремени";
	ИначеЕсли Значение = Тип("Тип") Тогда
		Возврат "Тип_Тип";
	ИначеЕсли Значение = Тип("УникальныйИдентификатор") Тогда
		Возврат "Тип_УникальныйИдентификатор";
	ИначеЕсли Значение = Тип("Неопределено") Тогда
		Возврат "Тип_Неопределено";
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "Тип_СправочникСсылка";
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "Тип_ДокументСсылка";
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "Тип_ПеречислениеСсылка";
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "Тип_ПланВидовХарактеристикСсылка";
	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "Тип_ПланСчетовСсылка";
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "Тип_ПланВидовРасчетаСсылка";
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "Тип_БизнесПроцессСсылка";
	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "Тип_ЗадачаСсылка";
	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "Тип_ПланОбменаСсылка";
	ИначеЕсли Значение = Тип("Null") Тогда
		Возврат "Тип_Null";
	ИначеЕсли Значение = Тип("ВидДвиженияБухгалтерии") Тогда
		Возврат "Тип_ВидДвиженияБухгалтерии";
	ИначеЕсли Значение = Тип("ВидДвиженияНакопления") Тогда
		Возврат "Тип_ВидДвиженияНакопления";
	ИначеЕсли Значение = Тип("ВидСчета") Тогда
		Возврат "Тип_ВидСчета";
	Иначе
		Возврат "Тип_Неопределено";
	КонецЕсли;

КонецФункции

Функция ПолучитьИмяТипа(Значение) Экспорт

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Значение);
	ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
	ЗначениеТипа = ОписаниеТиповЗначения.ПривестиЗначение(Неопределено);

	Если Значение = Тип("Неопределено") Тогда
		Возврат "Неопределено";
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "СправочникСсылка." + ЗначениеТипа.Метаданные().Имя;
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "ДокументСсылка." + ЗначениеТипа.Метаданные().Имя;
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "ПеречислениеСсылка." + ЗначениеТипа.Метаданные().Имя;
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "ПланВидовХарактеристикСсылка." + ЗначениеТипа.Метаданные().Имя;
	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "ПланСчетовСсылка." + ЗначениеТипа.Метаданные().Имя;
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "ПланВидовРасчетаСсылка." + ЗначениеТипа.Метаданные().Имя;
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "БизнесПроцессСсылка." + ЗначениеТипа.Метаданные().Имя;
	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "ЗадачаСсылка." + ЗначениеТипа.Метаданные().Имя;
	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(Значение) Тогда
		Возврат "ПланОбменаСсылка." + ЗначениеТипа.Метаданные().Имя;
	ИначеЕсли Значение = Тип("Null") Тогда
		Возврат "Null";
	ИначеЕсли Значение = Тип("ВидДвиженияБухгалтерии") Тогда
		Возврат "ВидДвиженияБухгалтерии";
	ИначеЕсли Значение = Тип("ВидДвиженияНакопления") Тогда
		Возврат "ВидДвиженияНакопления";
	ИначеЕсли Значение = Тип("ВидСчета") Тогда
		Возврат "ВидСчета";
	ИначеЕсли Значение = Тип("УникальныйИдентификатор") Тогда
		Возврат "УникальныйИдентификатор";
	Иначе
		Возврат Строка(Значение);
	КонецЕсли;

КонецФункции

Функция ПолучитьНеотображаемыеНаКлиентеТипы() Экспорт
	МассивТипы = Новый Массив;
	МассивТипы.Добавить(Тип("Тип"));
	МассивТипы.Добавить(Тип("МоментВремени"));
	МассивТипы.Добавить(Тип("Граница"));
	МассивТипы.Добавить(Тип("ХранилищеЗначения"));
	МассивТипы.Добавить(Тип("РезультатЗапроса"));
	Возврат МассивТипы;
КонецФункции

Функция СписокЗначенийИзМассива(Массив) Экспорт
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Массив);
	Возврат Список;
КонецФункции

Процедура ИзменитьТипКолонкиТаблицыЗначений(ТзДанные, ИмяКолонки, НовыйТипКолонки) Экспорт
	ИмяВременнойКолонки = ИмяКолонки + "_Вр31415926";
	МассивДанныеКолонки = тзДанные.ВыгрузитьКолонку(ИмяКолонки);
	ТзДанные.Колонки.Добавить(ИмяВременнойКолонки, НовыйТипКолонки);
	ТзДанные.ЗагрузитьКолонку(МассивДанныеКолонки, ИмяВременнойКолонки);
	ТзДанные.Колонки.Удалить(ИмяКолонки);
	ТзДанные.Колонки[ИмяВременнойКолонки].Имя = ИмяКолонки;
КонецПроцедуры

Функция СтрокаВЗначение(ЗначениеСтрокой) Экспорт
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ЗначениеСтрокой);
	Возврат СериализаторXDTO.ПрочитатьXML(Чтение);
КонецФункции

Функция ЗначениеВСтроку(Значение) Экспорт
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(Запись, Значение);
	Возврат Запись.Закрыть();
КонецФункции

#КонецОбласти
#Область Логирование
// Получает структуру параметров записи в журнал событий.
//
// Параметры:
//  ИмяСобытия	 - Строка - источник событий, если не указать источник, то запись производится не будет; 
//  Пользователь - СправочникСсылка.Пользователи 		- пользователь под которым выполняется запись;
//  Приложение   - ПеречислениеСсылка.спк_Приложения 	- приложение в котором выполняется запись.
//
// Возвращаемое значение:
//	Структура 
//		* ИмяСобытия		 	  	- Строка - Имя события; 
//		* Записывать		  		- Булево - Признак необходимости записи в журнал; 
//		* ИдентификаторЗаписи 		- Строка - GUID записи, необходим для обозначения итерации выполнения команды,
//									  позволяет разделить события в журнале, когда команда выполняется в разных сеансах
//									  параллельно;
//		* НомерЗаписи				- Число  - номер записи по порядку, необходим для упорядочивания событий в рамках 
//									  сенса с одинаковым значением "ИдентификаторЗаписи".  Увеличивается на 1 
//									  при каждой записи в журнал;
//		* ВремяНачала				- Число - Универсальная дата в миллисекундах, начала выполнения						  
//@skip-check doc-comment-field-in-description-suggestion
Функция ПолучитьПараметрыЛогирования(ИмяСобытия) Экспорт

	СтруктураПараметров = Новый Структура;

	СтруктураПараметров.Вставить("ИмяСобытия", ИмяСобытия);
	СтруктураПараметров.Вставить("Записывать", Истина);
	СтруктураПараметров.Вставить("ИдентификаторЗаписи", Строка(Новый УникальныйИдентификатор));
	СтруктураПараметров.Вставить("НомерЗаписи", 0);
	СтруктураПараметров.Вставить("ВремяНачала", ТекущаяУниверсальнаяДатаВМиллисекундах());
	СтруктураПараметров.Вставить("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	//@skip-check constructor-function-return-section
	Возврат СтруктураПараметров;

КонецФункции

// Записывает событие в журнал событий.
// Предназначена для записи событий обменов или других операций.
// 
// Параметры:
//  Комментарий 		- Строка - комментарий к событию;
//  УровеньСобытия 		- УровеньЖурналаРегистрации - УровеньЖурналаРегистрации;
//  ОбъектМетаданных 	- ОбъектМетаданных - Объект метаданных, к которому относится событие.
//  Данные 				- Число, Строка, Дата, Булево, Неопределено, Null, Тип - Данные, с которыми связано событие. 
// 			 				Рекомендуется указывать ссылки на объекты данных (элементы справочников, документы, 
// 			 				к которым относится событие).
Процедура ЗаписатьСобытиеВЖурналРегистрации(Комментарий, УровеньСобытия = Неопределено, ОбъектМетаданных = Неопределено,
	Данные = Неопределено) Экспорт

	Если Не ПараметрыЛогирования.Записывать Тогда
		Возврат;
	КонецЕсли;

	Если УровеньСобытия = Неопределено Тогда
		УровеньСобытия = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;

	ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ПараметрыЛогирования.ВремяНачала) / 1000;

	ПараметрыЛогирования.НомерЗаписи = ПараметрыЛогирования.НомерЗаписи + 1;
	КомментарийСтруктура  = Новый Структура;
	КомментарийСтруктура.Вставить("Комментарий", Комментарий);
	КомментарийСтруктура.Вставить("ИдентификаторЗаписи", ПараметрыЛогирования.ИдентификаторЗаписи);
	КомментарийСтруктура.Вставить("НомерЗаписи", ПараметрыЛогирования.НомерЗаписи);
	КомментарийСтруктура.Вставить("ВремяВыполнения", ВремяВыполнения);
	КомментарийСтруктура.Вставить("Пользователь", ЗначениеВСтрокуВнутр(ПараметрыЛогирования.Пользователь));

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, КомментарийСтруктура);
	КомментарийТекст = ЗаписьJSON.Закрыть();

	ЗаписьЖурналаРегистрации(ПараметрыЛогирования.ИмяСобытия, УровеньСобытия, ОбъектМетаданных, Данные,
		КомментарийТекст);

КонецПроцедуры
#КонецОбласти

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

#Область ЗагрузкаНастройкиПоУмолчанию
// Добавить строку с настройкой.
// 
// Параметры:
//  ТаблицаНастроек - ТаблицаЗначений - Таблица настроек
//  Имя - Строка - Имя параметра, задается по правилам именования переменных, в дальнешем исполюзутся, 
//  	как ключ в структуре для доступа к значению параметра.
//  ТипКонтейнера - Число - Описывает структуру для хранения параметра, доступны следующие варианты: 
// 		0 - Нет
// 		1 - СписокЗначений
// 		2 - Массив
// 		3 - ТаблицаЗначений
//  ТипЗначения - ОписаниеТипов, Строка - Описывает допустимые типы для параметра
//  Значение - Произвольный -  хранит значение(я) параметра в соответствии с определенными "ТипКонтейнера" 
//  	и "ТипЗначения"
//  Описание - Строка - - Прозвольный текст для описания параметра и его назначения
//  РежимЗагрузкиНастроекПоУмолчанию - Строка - Определяет режим добавления строк: "Обновление", "ДобавлениеНовых", 
//		"Замещение"
Процедура ДобавитьСтрокуСНастройкой(ТаблицаНастроек, Имя, ТипКонтейнера, ТипЗначения, Значение, Описание,
	РежимЗагрузкиНастроекПоУмолчанию)

	ДобавитьСтрокуСНастройкой = Ложь;

	Если РежимЗагрузкиНастроекПоУмолчанию = "Замещение" Тогда

		ДобавитьСтрокуСНастройкой = Истина;

	Иначе

		Строки	= ТаблицаНастроек.НайтиСтроки(Новый Структура("Имя", Имя));

		Если Строки.Количество() = 0 Тогда

			ДобавитьСтрокуСНастройкой = Истина;

		Иначе

			Если РежимЗагрузкиНастроекПоУмолчанию = "Обновление" Тогда

				Для Каждого стр Из Строки Цикл
					стр.Описание  = Описание;
				КонецЦикла;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	Если ДобавитьСтрокуСНастройкой Тогда

		стр = ТаблицаНастроек.Добавить();
		стр.Имя       = Имя;
		стр.Значение  = Значение;
		стр.Описание  = Описание;
		стр.Контейнер = Контейнер_СохранитьЗначение(Значение);
		стр.ТипКонтейнера = ТипКонтейнера;

		Если стр.ТипКонтейнера = 3 Тогда
			стр.ТипЗначения = "Таблица значений";
			стр.Значение  = стр.Контейнер.Представление;
		Иначе
			стр.ТипЗначения = ТипЗначения;
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ЧтениеНастройек
Процедура ПрочитатьНастройки(ИдентификаторКоманды, ОбработкаСсылка, ЕстьОшибки)
	НастройкиОбработки = Новый Структура;
	НастройкиОбработкиБезопасноеХранилище  = Новый Структура;
	НастройкиКомандИОбработки = Новый Структура;
	ПараметрыКоманды = Новый Структура;
	Сведения = СведенияОВнешнейОбработке();

	Для Каждого Команда Из Сведения.Команды Цикл

		Если Команда.Использование = "ВызовСерверногоМетода" Тогда

			НастройкиКомандИОбработки.Вставить(Команда.Идентификатор, Новый Структура);

		КонецЕсли;

	КонецЦикла;
	
	//  Чтение из хранилища обработки

	//@skip-check bsl-legacy-check-string-literal
	ХранилищеНастроек = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбработкаСсылка, "ХранилищеНастроек");
	НастройкиИзХранилищаНастроекОбработки = ХранилищеНастроек.Получить();

	Если ТипЗнч(НастройкиИзХранилищаНастроекОбработки) = Тип("Структура") Тогда

		// НастройкиОбработки
		Если НастройкиИзХранилищаНастроекОбработки.Свойство("НастройкиОбработки") Тогда
			Для Каждого стр Из НастройкиИзХранилищаНастроекОбработки.НастройкиОбработки Цикл
				НастройкиОбработки.Вставить(стр.Имя, Контейнер_ВосстановитьЗначение(стр.Контейнер));
			КонецЦикла;
		КонецЕсли;
		
		// НастройкиКоманд
		Для Каждого Команда Из Сведения.Команды Цикл

			Если Команда.Использование = "ВызовСерверногоМетода" Тогда

				КомандаНастройкиКоманды  = Новый Структура;

				Если НастройкиИзХранилищаНастроекОбработки.Свойство(Команда.Идентификатор) Тогда
					Для Каждого стр Из НастройкиИзХранилищаНастроекОбработки[Команда.Идентификатор] Цикл
						КомандаНастройкиКоманды.Вставить(стр.Имя, Контейнер_ВосстановитьЗначение(стр.Контейнер));
					КонецЦикла;
				КонецЕсли;

				НастройкиКомандИОбработки[Команда.Идентификатор].Вставить("НастройкиКоманды", КомандаНастройкиКоманды);

			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  


	// Чтение из безопасного хранилища

	НастройкиИзБезопасногоХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ОбработкаСсылка);

	Если ТипЗнч(НастройкиИзБезопасногоХранилища) = Тип("Структура") Тогда
		
		
		// Чтение настроек обработки из безопасного хранилища
		НастройкиОбработкиБезопасноеХранилище = Новый Структура;
		Если НастройкиИзБезопасногоХранилища.Свойство("НастройкиОбработкиБезопасноеХранилище") Тогда
			Для Каждого стр Из НастройкиИзБезопасногоХранилища.НастройкиОбработкиБезопасноеХранилище Цикл
				НастройкиОбработкиБезопасноеХранилище.Вставить(стр.Имя, Контейнер_ВосстановитьЗначение(стр.Контейнер));
			КонецЦикла;
		КонецЕсли;
		
		// Чтение настроек команд из безопасного хранилища	
		Для Каждого Команда Из Сведения.Команды Цикл

			Если Команда.Использование = "ВызовСерверногоМетода" Тогда

				КомандаНастройкиКомандыБезопасноеХранилище = Новый Структура;

				Если НастройкиИзБезопасногоХранилища.Свойство(Команда.Идентификатор) Тогда
					Для Каждого стр Из НастройкиИзБезопасногоХранилища[Команда.Идентификатор] Цикл
						КомандаНастройкиКомандыБезопасноеХранилище.Вставить(стр.Имя, Контейнер_ВосстановитьЗначение(
						стр.Контейнер));
					КонецЦикла;
				КонецЕсли;

				НастройкиКомандИОбработки[Команда.Идентификатор].Вставить("НастройкиКомандыБезопасноеХранилище",
					КомандаНастройкиКомандыБезопасноеХранилище);
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	НастройкиКоманды = НастройкиКомандИОбработки[ИдентификаторКоманды].НастройкиКоманды;
	НастройкиКомандыБезопасноеХранилище  = НастройкиКомандИОбработки[ИдентификаторКоманды].НастройкиКомандыБезопасноеХранилище;

	ПараметрыКоманды.Вставить("НастройкиОбработки", НастройкиОбработки);
	ПараметрыКоманды.Вставить("НастройкиОбработкиБезопасноеХранилище", НастройкиОбработкиБезопасноеХранилище);
	ПараметрыКоманды.Вставить("НастройкиКоманды", НастройкиКоманды);
	ПараметрыКоманды.Вставить("НастройкиКомандыБезопасноеХранилище", НастройкиКомандыБезопасноеХранилище);

	НастройкиКомандИОбработки.Вставить("НастройкиОбработки", НастройкиОбработки);
	НастройкиКомандИОбработки.Вставить("НастройкиОбработкиБезопасноеХранилище", НастройкиОбработкиБезопасноеХранилище);				

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКоманд
Процедура Команда1()
	ЗаписатьСобытиеВЖурналРегистрации("Выполнение Команда1");
КонецПроцедуры

Процедура Команда2()
	ЗаписатьСобытиеВЖурналРегистрации("Выполнение Команда2");
КонецПроцедуры

Процедура Команда3()
	ЗаписатьСобытиеВЖурналРегистрации("Выполнение Команда3");
КонецПроцедуры

#КонецОбласти
#КонецОбласти
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли