
&НаКлиенте
Процедура ЗначенияНастроекЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
КонецПроцедуры



&НаСервере
Процедура ЗагрузитьНастройкиНаСервере()

	СтруктураНастроек = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	// Настройки для сохранения в хранилище настроек обработки
	ДополнительнаяОбработкаОбъект = ДополнительнаяОбработка.ПолучитьОбъект();
	НастройкиДляСохранения = ДополнительнаяОбработкаОбъект.ХранилищеНастроек.Получить();

	Если НастройкиДляСохранения = Неопределено Тогда
		НастройкиДляСохранения = Новый Структура;
	КонецЕсли;
	
	// Настройки для сохранения в безопасное хранилище 
	НастройкиДляСохраненияБезопасноеХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ДополнительнаяОбработка);

	Если НастройкиДляСохраненияБезопасноеХранилище = Неопределено Тогда
		НастройкиДляСохраненияБезопасноеХранилище = Новый Структура;
	КонецЕсли;
	
	// Заполнение настроек 
	Для Каждого стр Из НастройкиДляИмпорта Цикл

		Если Не стр.Отметка Тогда
			Продолжить;
		КонецЕсли;

		Если стр.НазначениеНастройки = "Обработка" И стр.МестоХранения = "НастройкиОбработки" Тогда

			НастройкиОбработки = ЗначенияНастроек.Выгрузить();
			НастройкиОбработки.Очистить();
	
			//@skip-check empty-except-statement
			Попытка
				НастройкиОбработки = СтруктураНастроек["НастройкиИзХранилищаНастроекОбработки"]["НастройкиОбработки"];
			Исключение
			КонецПопытки;

			НастройкиДляСохранения.Вставить("НастройкиОбработки", НастройкиОбработки);

		ИначеЕсли стр.НазначениеНастройки = "Обработка" И стр.МестоХранения = "НастройкиОбработкиБезопасноеХранилище" Тогда

			НастройкиОбработкиБезопасноеХранилище = ЗначенияНастроек.Выгрузить();
			НастройкиОбработкиБезопасноеХранилище.Очистить();

			//@skip-check empty-except-statement
			Попытка
				НастройкиОбработкиБезопасноеХранилище = СтруктураНастроек["НастройкиИзХранилищаНастроекОбработки"]["НастройкиОбработки"];
			Исключение
			КонецПопытки;
			НастройкиДляСохраненияБезопасноеХранилище.Вставить("НастройкиОбработкиБезопасноеХранилище",
				НастройкиОбработкиБезопасноеХранилище);

		ИначеЕсли стр.НазначениеНастройки = "Команда" И стр.МестоХранения = "НастройкиКоманды" Тогда

			НастройкиКоманды = ЗначенияНастроек.Выгрузить();
			НастройкиКоманды.Очистить();
	
			//@skip-check empty-except-statement
			Попытка
				НастройкиКоманды = СтруктураНастроек["НастройкиИзХранилищаНастроекОбработки"][стр.КомандаИдентификатор];
			Исключение
			КонецПопытки;

			НастройкиДляСохранения.Вставить(стр.КомандаИдентификатор, НастройкиКоманды);

		ИначеЕсли стр.НазначениеНастройки = "Команда" И стр.МестоХранения = "НастройкиКомандыБезопасноеХранилище" Тогда

			НастройкиКомандыБезопасноеХранилище = ЗначенияНастроек.Выгрузить();
			НастройкиКомандыБезопасноеХранилище.Очистить();
	
			//@skip-check empty-except-statement
			Попытка
				НастройкиКомандыБезопасноеХранилище = СтруктураНастроек["НастройкиИзБезопасногоХранилища"][стр.КомандаИдентификатор];
			Исключение
			КонецПопытки;

			НастройкиДляСохраненияБезопасноеХранилище.Вставить(стр.КомандаИдентификатор,
				НастройкиКомандыБезопасноеХранилище);

		КонецЕсли;

	КонецЦикла;
	ДополнительнаяОбработкаОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(НастройкиДляСохранения);
	ДополнительнаяОбработкаОбъект.Записать();

	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ДополнительнаяОбработка,
		НастройкиДляСохраненияБезопасноеХранилище);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	ЗагрузитьНастройкиНаСервере();
	Закрыть();
КонецПроцедуры
&НаКлиенте
Процедура НастройкиДляИмпортаСнятьОтметку(Команда)
	Для Каждого стр Из НастройкиДляИмпорта Цикл
		стр.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДляИмпортаУстановитьОтметку(Команда)
	Для Каждого стр Из НастройкиДляИмпорта Цикл
		стр.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура НастройкиДляИмпортаПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("НастройкиДляИмпортаПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры
&НаКлиенте
Процедура НастройкиДляИмпортаПриАктивизацииСтрокиОбработчикОжидания()
	ЗначенияНастроек.Очистить();

	ТекущиеДанные = Элементы.НастройкиДляИмпорта.ТекущиеДанные;

	Если ТекущиеДанные <> Неопределено Тогда

		ЗаполнитьЗначенияНастроекПоСтрокеНаСервере(ТекущиеДанные.НазначениеНастройки,
			ТекущиеДанные.КомандаИдентификатор, ТекущиеДанные.МестоХранения);
	КонецЕсли;

	Элементы.ЗначенияНастроек.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияНастроекПоСтрокеНаСервере(НазначениеНастройки, КомандаИдентификатор, МестоХранения)

	//@skip-check empty-except-statement
	Попытка
		
		СтруктураНастроек = ПолучитьИзВременногоХранилища(АдресНастроек);

		Если НазначениеНастройки = "Обработка" И МестоХранения = "НастройкиОбработки" Тогда

			ЗначенияНастроек.Загрузить(СтруктураНастроек["НастройкиИзХранилищаНастроекОбработки"]["НастройкиОбработки"]);

		ИначеЕсли НазначениеНастройки = "Обработка" И МестоХранения = "НастройкиОбработкиБезопасноеХранилище" Тогда

			ЗначенияНастроек.Загрузить(
			СтруктураНастроек["НастройкиИзБезопасногоХранилища"]["НастройкиОбработкиБезопасноеХранилище"]);

		ИначеЕсли НазначениеНастройки = "Команда" И МестоХранения = "НастройкиКоманды" Тогда

			ЗначенияНастроек.Загрузить(
			СтруктураНастроек["НастройкиИзХранилищаНастроекОбработки"][КомандаИдентификатор]);

		ИначеЕсли НазначениеНастройки = "Команда" И МестоХранения = "НастройкиКомандыБезопасноеХранилище" Тогда

			ЗначенияНастроек.Загрузить(
			СтруктураНастроек["НастройкиИзБезопасногоХранилища"][КомандаИдентификатор]);

		КонецЕсли;

	Исключение
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//@skip-check unknown-form-parameter-access
	ДополнительнаяОбработка = Параметры.ДополнительнаяОбработка;
	//@skip-check unknown-form-parameter-access
	МассивКоманд = Параметры.МассивКоманд;
	//@skip-check unknown-form-parameter-access
	АдресФайлаНастроек = Параметры.АдресФайлаНастроек;
	
	
	// Заполнение таблицы НастройкиДляИмпорта
	СтрокаНастройкиДляИмпорта = НастройкиДляИмпорта.Добавить();
	СтрокаНастройкиДляИмпорта.Отметка = Истина;
	СтрокаНастройкиДляИмпорта.НазначениеНастройки = "Обработка";
	СтрокаНастройкиДляИмпорта.МестоХранения = "НастройкиОбработки";
	СтрокаНастройкиДляИмпорта.КомандаИдентификатор = "НастройкиОбработки";
	СтрокаНастройкиДляИмпорта.КомандаПредставление = "Настройки обработки";

	СтрокаНастройкиДляИмпорта = НастройкиДляИмпорта.Добавить();
	СтрокаНастройкиДляИмпорта.Отметка = Истина;
	СтрокаНастройкиДляИмпорта.НазначениеНастройки = "Обработка";
	СтрокаНастройкиДляИмпорта.МестоХранения = "НастройкиОбработкиБезопасноеХранилище";
	СтрокаНастройкиДляИмпорта.КомандаИдентификатор = "НастройкиОбработкиБезопасноеХранилище";
	СтрокаНастройкиДляИмпорта.КомандаПредставление = "Настройки обработки (Безопасное хранилище)";

	Для Каждого стр Из МассивКоманд Цикл

		СтрокаНастройкиДляИмпорта = НастройкиДляИмпорта.Добавить();
		СтрокаНастройкиДляИмпорта.Отметка = Истина;
		СтрокаНастройкиДляИмпорта.НазначениеНастройки = "Команда";
		СтрокаНастройкиДляИмпорта.МестоХранения = "НастройкиКоманды";
		СтрокаНастройкиДляИмпорта.КомандаИдентификатор = стр.Идентификатор;
		СтрокаНастройкиДляИмпорта.КомандаПредставление = стр.Представление;

		СтрокаНастройкиДляИмпорта = НастройкиДляИмпорта.Добавить();
		СтрокаНастройкиДляИмпорта.Отметка = Истина;
		СтрокаНастройкиДляИмпорта.НазначениеНастройки = "Команда";
		СтрокаНастройкиДляИмпорта.МестоХранения = "НастройкиКомандыБезопасноеХранилище";
		СтрокаНастройкиДляИмпорта.КомандаИдентификатор = стр.Идентификатор;
		СтрокаНастройкиДляИмпорта.КомандаПредставление = стр.Представление;

	КонецЦикла;
	
	// Чтение настроек из файла в кеш
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаНастроек);

	ПотокВПамяти = Новый ПотокВПамяти;
	ЗаписьДанных = Новый ЗаписьДанных(ПотокВПамяти);
	ЗаписьДанных.Записать(ДвоичныеДанные);
	ЗаписьДанных.Закрыть();
	ПотокВПамяти.Перейти(0, ПозицияВПотоке.Начало);

	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПотокВПамяти, КодировкаТекста.UTF8);
	ТекстНастроек = ТекстДок.ПолучитьТекст();

	ЕстьОшибки = Ложь;
	Попытка
		СтруктураНастроек = ЗначениеИзСтрокиВнутр(ТекстНастроек);
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			АдресНастроек = ПоместитьВоВременноеХранилище(СтруктураНастроек, УникальныйИдентификатор);
		Иначе
			ЕстьОшибки = Истина;
		КонецЕсли;
	Исключение
		ЕстьОшибки = Истина;
	КонецПопытки;

	Если ЕстьОшибки Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл содержит настройки неподдерживаемого формата!";
		Сообщение.Сообщить();
	КонецЕсли;	
	
КонецПроцедуры



